[
    {
        "position": -1,
        "text": "It's easy to get lost in an old house, looks like you'll have to start over.",
        "actions": [
            "Try again"
        ]
    },
    {
        "position": 0,
        "text": "You are standing outside a hundred-year-old three-story red-brick Queen Anne house you inherited by accident. The house is tucked in a dense bit of woods rumored to hold the Bandit Jack’s lost treasure. You think you hear a boy’s laughter coming from the trees, but that’s impossible. The closest neighbor is five miles away and, from what you’ve been told, hard of hearing. The only one here is you. One corner of the old house has sunk, pulling the bricks apart in a way that reminds you of teeth. You have the distinct sensation of being watched, but all the windows are dark. \n\n The key is in your hand. \n Would you like to go inside?",
        "actions": [
            "Yes",
            "No",
            "Try Pattern challenge!"
        ]
    },
    {
        "position": 1,
        "text": "The parlor is dark despite the late day’s sun, and you throw open the blackout curtains. The view from here is beautiful—a grassy lawn, a winding dirt road that disappears into the forest—but when you turn back to the room, you see a splatter of blood on the opposite wall. The man who lived here before was an experimental physicist playing with pocket universes. You knew he’d gone missing—you’d agreed to search the house for clues of where he might have gone—but no one had said anything about murder. Would you like to keep exploring the house, or is it time to leave?",
        "actions": [
            "Leave",
            "Explore"
        ]
    },
    {
        "position": 2,
        "text": "The sun sets behind the woods, and the front lawn falls unnaturally dark. The shadows stretch tall and lope at the forest’s edge. You can’t see eyes or mouths, but you know they have them. You close the door. You cannot leave now.",
        "actions": [
            "Continue"
        ]
    },
    {
        "position": 3,
        "text": "You turn on the overhead light. There is a cold fireplace and a chess table. The chess pieces move on their own, as if being played by invisible hands. Above the fireplace is a framed map, brown with age, the creases worn thin. It looks to you like a map of this property, the house at the center, the surrounding woods scattered with symbols you don’t recognize. A __, a ___. A rotary phone sits on the mantel. It rings. Do you answer?",
        "actions": [
            "Yes",
            "No"
        ]
    },
    {
        "position": 4,
        "text": "You hear a muffled voice, like someone is speaking from very far away. Hello? you say. Who is this? But it’s impossible to hear what they’re saying. You hang up before they’re finished speaking. When you go to unplug the phone, you find that the phone is already unplugged.",
        "actions": [
            "Continue"
        ]
    },
    {
        "position": 5,
        "text": "The phone rings twice more, then stops. The receiver sits still in the cradle, as if the phone never rang in the first place.",
        "actions": [
            "Continue"
        ]
    },
    {
        "position": 6,
        "text": "A pebble hits the window, but when you turn to look, no one’s there. Or at least, not that you can see. Light inside, dark outside. All you see is in the window is your reflection. You move deeper into the house.",
        "actions": [
            "Continue"
        ]
    },
    {
        "position": 7,
        "text": "You are relieved to find the sitting room is clean of blood. This room opens to the back of the house, where an overgrown garden sprawls. You can see shadows slinking through a tangle of rosebushes. You make out a garden shed at the edge, before the woods begin. You close the curtains and turn your attention to the room. A floor-to-ceiling bookshelf filled with Jules Verne and scientific journals. A couple of overstuffed chairs. A polished wood bar and a leather-bound log book. A player piano. You turn a key in the piano and Moon River begins to play, the keys depressing on their own. Upstairs, a floorboard creaks. You were told the house was vacant. You might be in over your head here. Would you like to pour yourself a drink to steady the nerves?",
        "actions": [
            "Yes",
            "No"
        ]
    },
    {
        "position": 8,
        "text": "There are three bottles on the bar: vodka, gin, and whiskey. They have all been opened, but they are all more than half full. Which do you choose?",
        "actions": [
            "Vodka",
            "Gin",
            "Whiskey"
        ]
    },
    {
        "position": 9,
        "text": "You pour a finger of vodka into a glass tumbler and drink. It burns your throat in a good way and makes you feel calmer than before. You make your way to the adjacent dining room.",
        "actions": [
            "Continue"
        ]
    },
    {
        "position": 10,
        "text": "You pour a finger of gin into a glass tumbler and drink. You feel lightheaded. The room blurs at the edges and you hit the ground hard, bruising your shoulder. You come to a few hours later. The clock on the bar reads midnight. Your mouth is dry and your head feels fuzzy, but you are all right. Alive. Who would poison the gin, and why? You think of the blood in the parlor, the missing physicist. The upstairs floorboards are creaking like someone pacing. You’re not thinking straight. You need some water. Would you like to move on to the next room?",
        "actions": [
            "Yes"
        ]
    },
    {
        "position": 11,
        "text": "You pour a finger of whiskey into a glass tumbler and drink. The world seems to slip its axis and you are in the same sitting room—the player piano, the bookshelf, the bar—but now everything is studded in pink gems glowing with some internal light. What is this place? you ask, and the gems pulse brighter as if in response. They are warm to the touch and remind you of anemone, though they are not underwater, they are not soft. You apply gentle pressure to the largest one, but as soon as the gem cracks free, they all do. They clatter to the floor like an avalanche and then they are gone. The sitting room is the sitting room once more, lamplit and gem-less. Your hands are empty. Do you pour another drink, or do you move on to the adjacent dining room?",
        "actions": [
            "Pour another",
            "Exit to dining room"
        ]
    },
    {
        "position": 12,
        "text": "DINING ROOM",
        "actions": []
    },
    {
        "position": 13,
        "text": "This is the end of the first chapter of SHADOW HOUSE. If you’d like to be notified of future chapters, please leave your email address. Thanks for playing.",
        "actions": [
            "PATTERN_CHALLENGE"
        ]
    }
]